Revit 2027 API
AdaptivePointOrientationType Enumeration
 An enumerated type containing possible orientation types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AdaptivePointOrientationType
Public Enumeration AdaptivePointOrientationType
public enum class AdaptivePointOrientationType
type AdaptivePointOrientationType
Members
Member name | Value | Description
ToGlobalXYZ | 7
The adaptive point will be oriented to the coordinate system of the document the instance is placed in.
This option was previously named: PlacementOrthogonal
ToGlobalZthenHost | 6
The Z axis of the adaptive point will be oriented to the Z axis of the document the instance is placed in. The XY axis are determined by the XY of the geometry the point is hosted on.
This option was previously named: PlacementVertical.
ToHost | 2
The adaptive point will be oriented to the coordinate system of the geometry the point is hosted on. This option was previously named: HostReferenceStrictly
ToHostAndLoopSystem | 3
The adaptive point will be oriented to the coordinate system of the geometry the point is hosted on. However, the orientation of the Z axis is controlled by the order of placed points. If the placed adaptive points of a component are placed in a different order with respect to the host order, (clockwise instead of counter-clockwise), then the Z axis will invert and the planar projection will flip.
This option was previously named: HostReferenceAutoFlip.
ToInstance | 9
The adaptive point will be oriented to the coordinate system of the adaptive family instance the point is part of. This is the default orientation of adaptive points.
This option was previously named: FamilyOrthogonal
ToInstanceZthenHost | 8
The Z axis of the adaptive point will be oriented to the Z axis of the adaptive family instance the point is part of. The XY axis are determined by the XY of the geometry the point is hosted on.
This option was previously named: FamilyVertical
Remarks
The default orientation of adaptive points is AdaptivePointOrientationType.ToInstance.
All the items of this enumerated type were renamed for Revit 2016 to better align the names with the corresponding text in the Revit UI. The numeric values of the items weren't modified, allowing existing applications to work. However, to be able to rebuild an application, all point orientations need to be changed to their respective new names.
See Also
Reference
Autodesk.Revit.DB Namespace